tutorials/heatTransfer/chtMultiRegionFoam/shellAndTubeHeatExchanger/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

baffles
{
    baffles1
    {
        type        faceZone;
        zoneName    shell_to_solid;

        patches
        {
            master
            {
                name        shell_to_solid;
                type        mappedWall;
                sampleMode  nearestPatchFace;
                sampleRegion solid;
                samplePatch solid_to_shell;
            }
            slave
            {
                name        solid_to_shell;
                type        mappedWall;
                sampleMode  nearestPatchFace;
                sampleRegion shell;
                samplePatch shell_to_solid;
            }
        }
    }

    baffles2
    {
        type        faceZone;
        zoneName    tube_to_solid;

        patches
        {
            master
            {
                name        tube_to_solid;
                type        mappedWall;
                sampleMode  nearestPatchFace;
                sampleRegion solid;
                samplePatch solid_to_tube;
            }
            slave
            {
                name        solid_to_tube;
                type        mappedWall;
                sampleMode  nearestPatchFace;
                sampleRegion tube;
                samplePatch tube_to_solid;
            }
        }
    }
}


// ************************************************************************* //
